from aiogram.types import Message
from aiogram.filters import Command
from aiogram import Router, F

router = Router()

@router.message(F.text == "помощь📒")
async def help(message: Message):
    await message.answer("Добро пожаловать в нашего TODO-бота — вашего личного помощника для наведения порядка в делах, планах и идеях!" \
    " Здесь вы можете быстро фиксировать задачи, разбивать их на категории, ставить дедлайны и возвращаться к ним тогда, когда это удобно." \
    " Бот создан для того, чтобы вы не держали всё в голове и не теряли важные мысли в потоке событий.")
    await message.answer("Просто отправьте задачу в чат, а я аккуратно помещу её в ваш список." \
    " Хотите изменить, отметить как выполненную или удалить — не проблема, все команды интуитивно просты.")
    await message.answer("Почта для связи по техническим вопросам:\nvealkebusiness@gmail.com")